Catalogs/ЗначенияПрогрессаОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЗначенияПрогрессаОбучения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Прогресс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЗначенияПрогрессаОбучения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПриНачальномЗаполненииЭлементов");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
	
КонецПроцедуры

#КонецОбласти

Функция ЗначенияПрогрессаОбучения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПрогрессаОбучения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗначенияПрогрессаОбучения КАК ЗначенияПрогрессаОбучения
		|ГДЕ
		|	НЕ ЗначенияПрогрессаОбучения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначенияПрогрессаОбучения.Прогресс";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#Область ОбработчикиОбновления

Процедура ПриНачальномЗаполненииЭлементов(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(НайтиПоНаименованию(НСтр("ru='0%'"))) Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЗначенияПрогрессаОбучения");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		// 0%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='0%'");
		ЗначениеПрогресса.Прогресс = 0;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 0;
		ЗначениеПрогресса.Записать();
		
		// 10%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='10%'");
		ЗначениеПрогресса.Прогресс = 10;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 10;
		ЗначениеПрогресса.Записать();
		
		// 20%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='20%'");
		ЗначениеПрогресса.Прогресс = 20;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 20;
		ЗначениеПрогресса.Записать();
		
		// 30%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='30%'");
		ЗначениеПрогресса.Прогресс = 30;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 30;
		ЗначениеПрогресса.Записать();
		
		// 40%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='40%'");
		ЗначениеПрогресса.Прогресс = 40;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 40;
		ЗначениеПрогресса.Записать();
		
		// 50%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='50%'");
		ЗначениеПрогресса.Прогресс = 50;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 50;
		ЗначениеПрогресса.Записать();
		
		// 60%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='60%'");
		ЗначениеПрогресса.Прогресс = 60;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 60;
		ЗначениеПрогресса.Записать();
		
		// 70%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='70%'");
		ЗначениеПрогресса.Прогресс = 70;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 70;
		ЗначениеПрогресса.Записать();
		
		// 80%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='80%'");
		ЗначениеПрогресса.Прогресс = 80;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 80;
		ЗначениеПрогресса.Записать();
		
		// 90%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='90%'");
		ЗначениеПрогресса.Прогресс = 90;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 90;
		ЗначениеПрогресса.Записать();
		
		// 100%
		ЗначениеПрогресса = СоздатьЭлемент();
		ЗначениеПрогресса.Наименование = НСтр("ru='100%'");
		ЗначениеПрогресса.Прогресс = 100;
		ЗначениеПрогресса.РеквизитДопУпорядочивания = 100;
		ЗначениеПрогресса.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
